benchmark/results/2pl_c10.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: benchmark/workload_2pl.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 4
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 371192
number of failed transactions: 0 (0.000%)
latency average = 1.616 ms
initial connection time = 27.964 ms
tps = 6189.071265 (without initial connection time)