benchmark/results/2pl_c100.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: benchmark/workload_2pl.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 16
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 566189
number of failed transactions: 0 (0.000%)
latency average = 10.556 ms
initial connection time = 253.428 ms
tps = 9473.051206 (without initial connection time)